# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние
# между ними в 2D пространстве.
# Пример:
# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,2

a = [int(i) for i in input('Введите координаты точки А= ').split()] 
b = [int(i) for i in input('Введите координаты точки В= ').split()]
len_line=((a[0]-b[0])**2+(a[1]-b[1])**2)**(0,5)

print(len_line, 2)


# from cmath import sqrt


# print('Введите координаты точки А')
# x1= float(input())
# y1= float(input())
# print('Введите координаты чочки В')
# x2= float(input())
# y2= float(input())
# a=(x1-y1**2 +x2-y2**2)**(0,5)
# print (a)